Revit 2026 API

# UIControlledApplicationGetRibbonPanels Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual List<RibbonPanel> GetRibbonPanels()
```
```vb
Public Overridable Function GetRibbonPanels As List(Of RibbonPanel)
```
```cpp
public:
virtual List<RibbonPanel^>^ GetRibbonPanels()
```
```fsharp
abstract GetRibbonPanels : unit -> List<RibbonPanel>
override GetRibbonPanels : unit -> List<RibbonPanel>
```

#### Return Value

ListRibbonPanel

#### Reference

UIControlledApplication Class

GetRibbonPanels Overload

Autodesk.Revit.UI Namespace